Ran Plan for project: `kms/devart-id/ap-northeast-2` dir: `terraform/kms/devart-id/ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_kms_key.deployment_common: Refreshing state... [id=17eb8659-5dbd-41a9-9048-0f9dff392fee]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_kms_alias.test_kms_alias will be created
+ resource "aws_kms_alias" "test_kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/test"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.deployment_common will be destroyed
  # (because aws_kms_key.deployment_common is not in configuration)
- resource "aws_kms_key" "deployment_common" {
      - arn                                = "arn:aws:kms:ap-northeast-2:816736805842:key/17eb8659-5dbd-41a9-9048-0f9dff392fee" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "KMS key for common secrets in ap-northeast-2." -> null
      - enable_key_rotation                = true -> null
      - id                                 = "17eb8659-5dbd-41a9-9048-0f9dff392fee" -> null
      - is_enabled                         = true -> null
      - key_id                             = "17eb8659-5dbd-41a9-9048-0f9dff392fee" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "deployment-common"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::816736805842:root",
                            ]
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # aws_kms_key.test will be created
+ resource "aws_kms_key" "test" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for common secrets in ap-northeast-2."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "test"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::816736805842:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p kms/devart-id/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.devart.tv/lock?id=YoungJinJung%252Fterraform-provisioning%252Fterraform%252Fkms%252Fdevart-id%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p kms/devart-id/ap-northeast-2`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
